package com.wjx.a06regexdemo;

public class Demo7 {
  public static void main(String[] args) {

    /*
    *   下面文本中的座机电话，邮箱，手机号，热线都爬取出来。
    *   来黑马程序员学习Java，
    *   手机号：13604701584，13904700134
    *   或者联系邮箱：boniu@itcast.cn，
    *   座机电话：01036517895，010-98951256
    *   邮箱：bozai@itcast.cn，
    *   热线电话：400-618-9090，400-618-4000，4006184000，4006189090
    * */

    String s = "来黑马程序员学习Java，" +
      "手机号：13604701584，13904700134" +
      "或者联系邮箱：boniu@itcast.cn" +
      "座机电话：01036517895，010-98951256" +
      "邮箱：bozai@itcast.cn" +
      "热线电话：400-618-9090，400-618-4000，4006184000，4006189090";

  }
}
